import os
from dotenv import load_dotenv

load_dotenv()

TOKEN = os.getenv('TOKEN')

QUESTIONS = [
    {
        "text": "Где вы хотели бы жить?",
        "answers": [
            {"text": "В лесу", "points": {"дикобраз": 2, "рысь": 3}},
            {"text": "В степи", "points": {"зебра": 3}},
            {"text": "На берегу реки", "points": {"выдра": 2, "лебедь": 3}},
            {"text": "В горах", "points": {"снежный барс": 3}}
        ]
    },
    {
        "text": "Какая у вас любимая еда?",
        "answers": [
            {"text": "Фрукты и овощи", "points": {"дикобраз": 3, "зебра": 2}},
            {"text": "Рыба", "points": {"выдра": 3}},
            {"text": "Мясо", "points": {"рысь": 3, "снежный барс": 2}},
            {"text": "Зерно", "points": {"лебедь": 3}}
        ]
    },
    {
        "text": "Как вы предпочитаете проводить свободное время?",
        "answers": [
            {"text": "В спокойствии и размышлениях", "points": {"лебедь": 3}},
            {"text": "За активными играми", "points": {"выдра": 2, "зебра": 3}},
            {"text": "Исследуя природу", "points": {"снежный барс": 3, "рысь": 2}},
            {"text": "В комфортной зоне", "points": {"дикобраз": 3}}
        ]
    },
    {
        "text": "Какой у вас характер?",
        "answers": [
            {"text": "Терпеливый и заботливый", "points": {"дикобраз": 3}},
            {"text": "Энергичный и любопытный", "points": {"выдра": 2, "зебра": 3}},
            {"text": "Независимый и немного таинственный", "points": {"рысь": 3, "снежный барс": 2}},
            {"text": "Спокойный и величественный", "points": {"лебедь": 3}}
        ]
    },
]

RESULTS = {
    "дикобраз": {"description": "Ты дикобраз! Осторожный, но выносливый.", "image": "https://example.com/dikobraz.jpg"},
    "рысь": {"description": "Ты рысь! Независимый и скрытный.", "image": "https://example.com/rys.jpg"},
    "снежный барс": {"description": "Ты снежный барс! Свободолюбивый исследователь.", "image": "https://example.com/bars.jpg"},
    "зебра": {"description": "Ты зебра! Энергичный и дружелюбный.", "image": "https://example.com/zebra.jpg"},
    "выдра": {"description": "Ты выдра! Любопытный и игривый.", "image": "https://example.com/vydra.jpg"},
    "лебедь": {"description": "Ты лебедь! Спокойный и величественный.", "image": "https://example.com/leb.jpg"}
}